_loadTesting/golangdocker-loadtest.yml
config:
  phases:
    - duration: 60
      arrivalRate: 10
      name: Sustained load
  processor: "custom-artillery-functions.js"
scenarios:
  - name: "golang.0nezer0.com"
    flow:

    - get:
        url: "/v1/host"
        capture:
          - json: "$['hostInfo']['virtualizationSystem']"
            as: "virtualizationSystem"
          - json: "$['hostInfo']['hostname']"
            as: "hostname"
        afterResponse: "logHeaders"
    - log: "{{ hostname }} [{{ virtualizationSystem }}]"